;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION = software di correzione HL
ID1022 = set di soluzione
ID1023 = Seleziona:
ID1007 = salva un altro come
ID1017 = elimina
ID1084 = importazione
ID1085 = esportazione

ID1075 = intestazione corretta
ID1024 = parametri di base
ID1025 = intervallo di velocità (mm):
ID1026 = intervallo di marcatura (mm):
ID1072 = sistema di coordinate
ID1077 = angolo rotante
ID1079 = x Offset (mm)
ID1080 = Y Offset (mm)
ID1119 = specchio di vibrazione 1 = x
ID1120 = specchio vibrazione 2 = x
ID1116 = retromarcia
ID1117 = retromarcia

ID1030 = correzione della griglia e del livello (doppio clic per visualizzare la finestra di calcolo automatico dopo aver selezionato il rapporto zoom)
ID1009 = Aggiungi livello
ID1010 = Elimina livello
ID1012 = effetto complessivo a più livelli
ID1031 = torna al livello delle parole:
ID1018 = grafico di testo di marchio massimo

ID1053 = correzione del Guang rosso
ID1043 = abilita
ID1054 = X Rapporto di astabilità:
ID1055 = Y Rapporto zoom:
ID1056 = X spostamento (mm):
ID1057 = Y Deviation (mm):

ID1058 = focus
ID1065 = Metodo di messa a fuoco
ID1059 = tipo di messa a fuoco dinamico
ID1060 = modalità di controllo
ID1061 = spaziatura di un albero (mm)
ID1082 = Fangtou all'altezza del piano di lavoro (mm)
ID1063 = valore di perfezionamento fine (UM)
ID1062 = coefficiente di compensazione di messa a fuoco dinamico

ID1011 = test f7
ID1037 = stop
ID1014 = parametro >>

ID1109 = Tipo corretto
ID1099 = correzione ordinaria
ID1100 = CORREZIONE ALTA -Precisione 1 [Scanner]
ID1101 = correzione ad alta preconcezione [Importa dati di coordinate reali]
ID1110=Istruzioni di correzione di alta precisione: 1. in primo luogo, selezionare la correzione regolare per la correzione di routine ed effettuare le regolazioni preliminari al sistema di coordinate, alla correzione della luce rossa, alla dimensione della scatola e alla deformazione. 2. Selezionare la correzione di alta precisione per generare punti di griglia. 3. Dopo aver ottenuto ed elaborato i dati utilizzando diversi strumenti, importare i dati.
ID1114=Importa direttamente dati di correzione ad alta precisione

ID1089 = correzione ad alta precina
ID1086 = Genera il punto della griglia
ID1111 = Primo passaggio: generare il punto della griglia.
ID1112 = Passaggio 2: introdurre i dati di coordinate reali misurati dallo scanner o misurazione bidimensionale.
ID1113 = Passaggio 3: creare una tabella di correzione ad alta precisione e confermare l'uscita di conservazione.

ID1096 = ridimensionamento
ID1027 = intervallo di marcatura ad alta precina (mm)
ID1097 = bump
ID1028 = dimensione della casella di prova (mm):
ID1091 = dati di importazione dopo l'elaborazione dello scanner
ID1087 = dati di importazione
ID1016 = Crea una tabella di correzione ad alta preconcetto
ID1139=Genera tabella di correzione
ID1 = ok
ID2 = annulla
ID1142=Controllo della marcatura

[CALISET_DLG_167]
CAPTION= importazione di dati ad alta precisione
ID1114 = x file di coordinate ottenuto dalla seconda dimensione:
ID1115 = Y file di coordinate ottenuto dalla seconda dimensione:
ID1 = ok
ID2 = annulla

[CALISET_DLG_159]
CAPTION= salva soluzione
ID1036 = lo schema di correzione è memorizzato separatamente:
ID1 = ok
ID2 = annulla

[CALISET_DLG_131]
CAPTION= parametro di marcatura
ID1032 = numero di tempi di marcatura:
ID1033 = velocità di marcatura (mm/s)
ID1035 = potenza (%)
ID1034 = Q Frequenza (KHz)
ID1036 = Q Tempo di rilascio (US)
ID1037 = latenza per turbruri laser (US)
ID1 = ok
ID2 = annulla

[CALISET_DLG_160]
CAPTION= Impostazione delle informazioni sull'etichetta dell'etichetta
ID1093 = numero di righe
ID1094 = numero di colonna
ID1116 = Imposta solo il numero di gradi, non contrassegnato
ID1 = marcatura
ID2 = annulla
ID1099=Punto
ID1100=Croce
ID1101=Cerchio

[CALISET_DLG_164]
CAPTION = selezionare la scheda di controllo
ID1098 = Seleziona una scheda di lavoro:
ID1 = ok
ID2 = annulla

[CALISET_STRINGTABLE]
ID0 = dimensione della casella (mm)
ID1 = rapporto zoom % % %
ID2 = Y Rapporto zoom % %
ID3 = x bumpy
ID4 = y bump
ID5 = x trapezoidale
ID6 = y trapezoidale
ID7 = x parallelo
ID8 = y parallelo
ID9 = x proporzione positiva % %
ID10 = rapporto negativo x % % %
ID11 = y proporzione positiva % %
ID12 = y proporzione negativa % %
ID13 = parametro \ level
ID14 = corrente (a)
ID15 = potenza (%)
ID16 = corrente (%)
ID17 = larghezza dell'impulso laser (NS)
ID18 = modalità laser
ID999 = ha già un software di marcatura o un software di correzione è in esecuzione, per favore chiuderlo prima!
ID1000 = perso o danni al file di benchmarking, conferma se il software è normale!
ID1001 = L'inizializzazione della scheda di controllo di marcatura non è riuscita!
ID1002 = Impostazioni del sistema di scheda di controllo dell'etichetta non riusciti!
ID1003 = Seleziona prima il livello di correzione che si desidera testare!
ID1004 = L'operazione non è riuscita, provalo più tardi!
ID1005 = Esiste un nome di schema che è già esistito?
ID1006 = L'ambito di correzione non può essere 0!
ID1007 = L'ambito della marcatura non può essere 0!
ID1008 = il coefficiente proporzionale dell'ambito di correzione e la portata della marcatura non è corretta.
ID1011 = Selezionare il livello per eliminare il livello
ID1012 = Si prega di mantenere almeno la prima correzione a livello!
ID1013 = errore del file!
ID1014 = Imposta i dati di correzione sulla scheda FAIL, provalo più tardi!
ID1015 = Questo schema di configurazione di correzione è incompatibile con l'attuale versione del software. È una lettura forzata?
ID1016 = dimensione della scatola non può superare l'intervallo di marcatura!
ID1017 = la dimensione della scatola non può superare la dimensione del livello precedente!
ID1018 = Le impostazioni di correzione corrente sono state modificate, è memorizzata?
ID1019 = File di lettura non riuscita!
ID1020 = confermare la cancellazione dello schema corrente?
ID1021 = i cani software non vengono rilevati!
ID1022 = cani software vengono rilevati, ma non cani software legali!
ID1023 = Ci sono più di 1 software legale inseriti!
ID1024 = Converti il ​​cane iniziale in un cane fallito!
ID1025 = "L'attuale autorizzazione del software è scaduta ed è necessario contattare il personale del servizio clienti per applicare per la corrispondenza della patch di licenza (ID cane =%S, codice di verifica =%s)
ID1026 = "D160"
ID1027 = "D480"
ID1028 = "CO2 Enhance"
ID1029 = "tradizione CO2"
ID1030 = "lancio non riuscito"
ID1031 = La dimensione della scatola non può essere inferiore al livello successivo!
ID1032 = oltre l'area di correzione effettiva
ID1033 = "FORTH FOCUS"
ID1034 = "coking dinamico 3D"
ID1035 = "Focus posteriore ordinario"
ID1036 = "La modalità di controllo laser semplice deve essere inferiore alla gamma di marcatura%dMM" "
ID1037 = "Ottieni l'ID cane memorizzato nella carta non riuscita, si prega di verificare se la carta è destinata a essere vincolata"
ID1038 = "import fail"
ID1039 = "Successo all'importazione"
ID1040 = "esportazione non riuscita"
ID1041 = "Export Success"
ID1042 = "Operation Fail"
ID1043 = "i dati del file non corrispondono"
ID1044 = "Focus 3D" in seguito "
ID1045 = "Il percorso del file di coordinate X è vuoto!"
ID1046 = "Il percorso del file di coordinate è vuoto!"
ID1047 = "Il cane sulla carta è incompatibile con il numero di cane crittografato"
ID1048 = "Il numero della scheda sulla scheda è vuoto o la lunghezza non è giusta" "

;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1=Scheda non inizializzata o carta non trovata!
2 = Reset non riuscito!
3 = La versione della carta non è giusta!
4 = Allarme!
6=Esecuzione non riuscita!
7=Lo stato non corrisponde!
16=Comando scaduto!
17=Comando perso!
18=Chiamata di interfaccia asincrona!
19=Interfaccia occupata da un altro programma!
20 = sovraccarico dell'asse Z o correzione della corruzione del file!
21=Mancata corrispondenza dei parametri!
23=Allocazione della memoria non riuscita!
100 = Utilizzo offline!
101=Comando interrotto!
1001=Porta 1
1002=Porta 2
1003=Porta 3
1004=Porta 4
1005=Porta 5
1006=Porta 6
1007=Porta 7
1008 = Ingresso laser non pronto
1009 = Predisposizione per l'ingresso laser

[4]
1 = Sovratemperatura del laser, si prega di spegnere l'alimentazione!
2 = Laser alto anti-allarme, si prega di spegnere l'alimentazione!
3 = Laser MO anormale, si prega di spegnere l'alimentazione!
4 = Il coperchio laser è aperto, si prega di spegnere l'alimentazione e installare il coperchio laser!
5 = La porta di sicurezza è aperta, si prega di chiuderla!
6 = L'otturatore è chiuso in modo anomalo, si prega di spegnere l'alimentazione e controllare l'otturatore!
7 = L'otturatore non è aperto in modo anomalo, si prega di spegnere l'alimentazione e controllare l'otturatore!
8 = La porta di sicurezza è aperta, la marcatura è in pausa, si prega di chiudere la porta di sicurezza per continuare la marcatura!
9 = Riparo mobile aperto, marcatura interrotta!
10 = Allarme del sistema laser, si prega di spegnere l'alimentazione!
11 = Tensione di alimentazione laser fuori portata, si prega di spegnere l'alimentazione!
12 = Allarme di sovratensione dell'alimentazione laser, spegnere l'alimentazione e controllare la potenza del laser!
13 = Allarme di sottotensione dell'alimentazione laser, spegnere l'alimentazione e controllare la potenza del laser!
14 = Allarme di sovratemperatura laser SPI, si prega di spegnere l'alimentazione!
15 = Allarme di sovracorrente dell'amplificatore pronto per il laser SPI, si prega di spegnere l'alimentazione!
16 = Allarme di sovracorrente dell'amplificatore di potenza laser SPI, si prega di spegnere l'alimentazione!
17 = allarme laser di collimazione laser SPI, si prega di spegnere l'alimentazione!
18 = allarme di ritenzione laser SPI, si prega di spegnere l'alimentazione!
19 = allarme di potenza laser SPI, si prega di spegnere l'alimentazione!
20 = Allarme laser sconosciuto, si prega di spegnere l'alimentazione!
21 = Allarme di sovracorrente di potenza laser, si prega di spegnere l'alimentazione!
22 = Allarme di sovratensione di potenza laser, si prega di spegnere l'alimentazione!
23 = Allarme di sovratemperatura della potenza laser, si prega di spegnere l'alimentazione e controllare le condizioni di dissipazione del calore!
24 = L'alimentazione laser non è accesa, controllare l'alimentazione.
30= Il limite negativo si incontra durante il movimento, la marcatura viene interrotta!
31= Quando si incontra un limite positivo durante il movimento, la marcatura viene interrotta!
32= Impulso motore fuori portata
33= Galvanometro DA fuori portata!
34= Limite super positivo dell'asse X della piattaforma!
35= limite over-negativo dell'asse X della piattaforma!
36= Limite super positivo dell'asse Y della piattaforma!
37= limite over-negativo dell'asse Y della piattaforma!
38 = La testa quadrata del galvanometro è alimentata in modo anomalo, si prega di spegnere l'alimentazione e controllare!
54=Si prega di passare alla tabella di correzione 512!
55=Si prega di passare alla tabella di correzione 128!
100 = Il riparo mobile è valido e aperto!

110 = Raggiungere un limite negativo!
111 = raggiungere un limite positivo!
112 = Colpisci l'origine in movimento!
500 = riscaldamento del galvanometro, riprova più tardi!

[door]
1 = La porta di sicurezza è aperta, si prega di chiudere la porta di sicurezza!
2 = La porta di sicurezza è aperta, la marcatura è in pausa, si prega di chiudere la porta di sicurezza per continuare la marcatura!
3 = La porta blindata viene aperta, la marcatura viene interrotta!
4 = La porta di sicurezza è chiusa, puoi continuare a segnare!
5=La porta di sicurezza è chiusa e lo stato è normale!
6=Il limite negativo si incontra durante l'esercizio, la marcatura viene interrotta!
7 = Il limite positivo viene incontrato durante il movimento e la marcatura viene interrotta! 

[usb]
1=Scheda EMCC già collegata
2=La scheda EMCC è stata disconnessa

[4101]
3=DA card 1 informazioni sulla funzione e sulla versione
4=Informazioni sulla data della versione della scheda DA 1
5 = Tempo trascorso della scheda DA 1
7 = numero di frame di errore per la scheda DA 1
9 = conto alla rovescia della scheda DA 1 per il tempo di errore del 4° bit
11 = Tempo del conto alla rovescia della scheda DA 1 per l'errore del 3 ° bit
13 = conto alla rovescia della scheda DA 1 il tempo dell'errore del 2 ° bit
15 = Ora dell'errore dell'ultimo bit sulla scheda DA 1

[4102]
4 = Numero di frame fuori codice della scheda DA 1
6 = DA card 1 conto alla rovescia il tempo della 4a miss
8 = DA card 1 conto alla rovescia il tempo del 3° codice mancato
10 = DA card 1 conto alla rovescia per il tempo del secondo codice mancante
12 = scheda DA 1 ultima volta persa il tempo
14=DA card 1 informazioni di allarme galvanometro
15 = scheda DA 1 galvanometro allarme off laser abilita

[4103]
3=DA card 2 informazioni sulla funzione e sulla versione
4=Informazioni sulla data della versione della scheda DA 2
5 = Tempo trascorso della scheda DA 2
7 = Numero di frame di errore per la scheda DA 2
9 = Tempo di conto alla rovescia della scheda DA 2 per l'errore del 4° bit
11 = Tempo di conto alla rovescia della scheda DA 2 per l'errore del 3 ° bit
13 = conto alla rovescia della scheda DA 2 il tempo dell'errore del secondo bit
15 = ora dell'ultimo errore di bit sulla scheda DA 2

[4104]
4 = il numero di frame fuori codice della scheda DA 2
6 = DA card 2 conto alla rovescia il tempo della 4a miss
8 = DA card 2 conto alla rovescia il tempo della terza miss
10 = Scheda DA 2 penultimo tempo di perdita
12 = l'ora in cui la scheda DA 2 è stata persa l'ultima volta
14=DA card 2 informazioni di allarme galvanometro
15 = scheda DA 2 galvanometro allarme off laser abilita

[4105]
3 = Funzione della scheda LASER e informazioni sulla versione
4=Informazioni sulla data della versione della scheda LASER
5 = TEMPO TRASCORSO DELLA SCHEDA LASER
7 = NUMERO DI FOTOGRAMMI DI ERRORE PER LA SCHEDA LASER
9 = Tempo del penultimo errore di bit della scheda LASER
11 = Ora del penultimo errore di bit della scheda LASER
13 = Tempo di conto alla rovescia per l'errore a 2 bit della scheda LASER
15 = Ora dell'ultimo errore di bit sulla scheda LASER

[4106]
4 = NUMERO DI FOTOGRAMMI MANCANTI DELLA SCHEDA LASER
6 = Il momento in cui la scheda LASER perde il suo codice per il 4° conto alla rovescia
8 = Il momento in cui la scheda LASER perde il codice per il 3° conto alla rovescia
10 = Il momento in cui la scheda LASER perde il codice per la penultima volta
12 = Ultimo codice mancante della scheda LASER
14 = messaggio di allarme galvanometro LASER
15 = allarme laser della scheda LASER off laser abilita il laser

[4107]
3 = forma d'onda ns corrente laser della scheda LASER
4 = Scheda LASER corrente laser ps forma d'onda
5 = LASER card forma d'onda fs corrente laser
6 = Il laser della scheda LASER mantiene attualmente la potenza

[4102Warning]
0=D0: scheda DA 1 comunicazione dati anomala
1=D1: scheda DA 1 allarme del sistema di scansione
2 = D2: scheda DA 1 allarme di temperatura dello scanner
3 = D3: scheda DA 1 allarme a bassa velocità dello scanner
4=D4: Non utilizzato
5=D5: Non utilizzato
6=D6: Non in uso
7=D7: Non in uso
8=D8: Non in uso
9=D9: Non in uso
10=D10: Non in uso
11=D11: Non in uso
12=D12: Non in uso
13=D13: Non in uso
14=D14: Non in uso
15=D15: scheda EMCC Comunicazione dati anomala

[4104Warning]
0=D0: comunicazione dati anomala della scheda DA 2
1 = D1: allarme del sistema di scansione DA Card 2
2 = D2: scheda DA 2 Allarme di temperatura dello scanner
3 = D3: scheda DA 2 Allarme a bassa velocità dello scanner
4=D4: Non utilizzato
5=D5: Non utilizzato
6=D6: Non in uso
7=D7: Non in uso
8=D8: Non in uso
9=D9: Non in uso
10=D10: Non in uso
11=D11: Non in uso
12=D12: Non in uso
13=D13: Non in uso
14=D14: Non in uso
15=D15: Non in uso

[4106Warning]
0=D0: comunicazione dati scheda LASER anomala
1=D1: allarme temperatura laser
2=D2: allarme di alimentazione
3=D3: allarme di sistema
4 = D4: alto anti-allarme
5=D5: Il laser non è pronto
6=D6: Accensione laser seme fallita
7=D7: allarme di temperatura laser seme
8=D8: allarme sovracorrente MO
9=D9: allarme sovracorrente PA
10=D10: Allarme collimatore
11=D11: Tenere la sveglia 5
12=D12: Tenere sveglia 4
13=D13: Tenere la sveglia 3
14=D14: Tenere la sveglia 2
15=D15: Tenere la sveglia 1

[Refresh]
Interval=500


